examples/CranfieldRunway/openfoam/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

transportModel  Newtonian;

// Kinematic viscosity of air at ~12°C (Cranfield annual mean)
nu              1.47e-05;
