examples/CranfieldRunway/openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         500;

deltaT          1;

writeControl    timeStep;
writeInterval   100;
purgeWrite      2;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

libs ("libatmosphericModels.so");

// functions block omitted — solverInfo triggers a sha1 IOstream bug in
// packaged OF1912/aarch64 builds; monitor residuals via log.simpleFoam
